btw the terragrunt shows the following before he fails

```
 # aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = true
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = (known after apply)
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "public-api"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-11111111111111",
          + "subnet-11111111111112",
          + "subnet-11111111111113",
        ]
      + tags                                                         = {
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                                                     = {
          + "AccountID"             = "11111111111111"
          + "Config"                = "test"
          + "Env"                   = "test-development"
          + "Infra"                 = "test"
          + "Managed-by"            = "terraform"
          + "Owner"                 = "devops"
          + "Region"                = "eu-west-1"
          + "terraform-aws-modules" = "alb"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + timeouts {}
    }

  # aws_lb_listener.this["http-https-redirect"] will be created
  + resource "aws_lb_listener" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "terraform-aws-modules" = "alb"
        }
      + tags_all          = {
          + "AccountID"             = "11111111111111"
          + "Config"                = "test"
          + "Env"                   = "test-development"
          + "Infra"                 = "test"
          + "Managed-by"            = "terraform"
          + "Owner"                 = "devops"
          + "Region"                = "eu-west-1"
          + "terraform-aws-modules" = "alb"
        }

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_lb_target_group.this["rest-api"] will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "rest-api"
      + name_prefix                        = (known after apply)
      + port                               = 5001
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                           = {
          + "AccountID"             = "11111111111111"
          + "Config"                = "test"
          + "Env"                   = "test"
          + "Infra"                 = "test"
          + "Managed-by"            = "terraform"
          + "Owner"                 = "devops"
          + "Region"                = "eu-west-1"
          + "terraform-aws-modules" = "alb"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-11111111111111"
    }
```